<a href="https://colab.research.google.com/github/Johnsoneer/Climate-Change-Natural-Disasters/blob/main/Climate_Change_and_Economic_Impact.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [2]:
%cd drive/MyDrive
! git clone https://github.com/Johnsoneer/Climate-Change-Natural-Disasters.git

/content/drive/MyDrive
fatal: destination path 'Climate-Change-Natural-Disasters' already exists and is not an empty directory.

In [3]:
!cp Climate-Change-Natural-Disasters/Code/NaturalDisastersDataCleaner.py .
!cp Climate-Change-Natural-Disasters/Data/natural_disasters_original.csv .
!cp Climate-Change-Natural-Disasters/Data/natural_disaster_economic_impact_original.csv .

In [4]:
from NaturalDisastersDataCleaner import DisasterData

# Load our Dataset

In [5]:
obj = DisasterData(csv_strs = ['natural_disasters_original.csv',
                               'natural_disaster_economic_impact_original.csv'])

In [6]:
# Display our dataframe's top
obj.disaster_df.head()

                  Entity  ...  Number of reported natural disasters (reported disasters)
0  All natural disasters  ...                                                  5
1  All natural disasters  ...                                                  2
2  All natural disasters  ...                                                  9
3  All natural disasters  ...                                                  8
4  All natural disasters  ...                                                  2

[5 rows x 3 columns]

We noticed that the dataset appears to repeat years in for each disaster type. We also noticed that there were several missing values when we group by the year so we needed to clean those out.

Now let's look at the top of our economic column.

In [7]:
obj.economic_df.head()

                  Entity  ...  Total economic damage from natural disasters (US$)
0  All natural disasters  ...                                           30000000
1  All natural disasters  ...                                                  0
2  All natural disasters  ...                                                  0
3  All natural disasters  ...                                          480000000
4  All natural disasters  ...                                                  0

[5 rows x 4 columns]

Similar story. Let's clean this dataset so that we have one row per year, we have only the columns we care about, and we have ingore the years before 1970 and after 2015.

In [8]:
# Clean dataset and collect into one dataframe
obj.cleanDf()
obj.df.head()

      All natural disasters  Drought  ...  TotalCost: Landslide  TotalCost: Wildfire
Year                                  ...
1970                   77.0      2.0  ...                   NaN          100000000.0
1971                   61.0      7.0  ...                   NaN                  NaN
1972                   63.0      7.0  ...                   NaN                  NaN
1973                   60.0      2.0  ...                   NaN                  NaN
1974                   68.0      4.0  ...            21700000.0                  NaN

[5 rows x 14 columns]